#include <stdio.h>

    int main() {
    
    float float_score = 90.5f;
    printf("float score = %.1f\n", float_score);

    int int_score = 90.5; 
    printf("int score = %d\n", int_score);

    return 0; 
}


   
    


//คำถามท้ายโจทย์
//1.ผลลัพธ์ต่างกันอย่างไร?=[กรณ๊ที่1 ไม่แสดงค่าทศนิยม] [กรณีที่2 แสดงค่าทศนิยม]
//2.ทำไมต้องเลือกData Typeให้ถูกต้อง?=[เพื่อแสดงค่าoutputที่ถุกต้อง]
//3.อภิปราย= [เพื่อให้โปรแกรมทำงานได้มีประสิทธิภาพและแสดงผลลัพธ์ที่ถูกต้อง ต้องใช้Data Typeที่เหมาะสมกับข้อมูลที่ต้องการเก็บและแสดงผล]
